#include <stdio.h>
#include <unistd.h>
#undef getchar
#define getchar(x) getc(stdin)

#define D EOF
#define C ;

#define B ))
#define Β ])

#define R <<
#define L >>


/* The Atomic number for Gadolinium is 64*/
#define б4 64+64

unsigned char *В,*Х,X,x,p[4],
O[4],｛ =1,E,Ε=0,Е=1,｝ ,a=1;
int Ν, N, р; void (*О)(void);
char Ο, four,

/* Output routine */
**A, А [] = "\?\n@~ */\tint write_0utput() "
"{ putchar(c); } */ \\b\bV;E*@ int x=2053; ",
Α[]="int y=3502; ""\f\rt\ttA<=!"

/* The base64 character set */
"azAZ09/+";

int main(int,char**);

void decode() {
    for (Ν=Α['\f' L 1]^'@'[А];Ν<'@'>>(А['\n']-А[А['\n'>>1]>>1]);Ν++
    )p[Ν] = Α['&'/2];p[*Α L '\a']=(｝=(O[0]L 2),(X=Α[1+' '/2]-*(А+2
    ),a=2, main(А['2'],A B,x);p[*Α>>6]=(｝=(O[0]&('\a'>>1 B<<4|(O[1
    ]&-' '/2)L 4, a=2,main(0,A),x);(р>*А>>5)&&(p[2]=(｝=((O[1]&*А>>
    2)<<2|(O['@'/' ']&-(А[4]/А['0'Β)>>6),a=2,main(0,A),x B;(*(&р)>Α
    [А['\a']]-Α[А['0'] Β&&(p[Α['\f']>>2] = (｝= (O[2] &*А),a=2,main
    (0,A),x B;Х=((four=4),p);
}

void encode() {
    X=0,p[X]=p[!X]=p[!X<<!X]=А[!X]>>((!X<<!X)+!X); four=!X; p[0]=(
    X=0,((｝=(O[0 Β,a=2,main(X,A),x B R 2),p[*Α-А[64>>3]]|=((｝=(O
    [А['\f']>>(Α['\f']>>1)Β,a=Α['\t' ]-'\b'[Α],main(!X,A),x)>>(А[Α
    [64>>((б4+64)/64)]]>>1)); (O[2]!='=')&&four++,p[Α[1]>>6]=((｝=
    (O[D*D Β,a=2,main(0,A),x)&(Α['\b']/3-1))<<(Α['<'/2>>1]>>1),p[1
    ]|=((｝=(O[!X<<!X Β, a=2,main(0,A),x)&'x'>>1)>>2; (O[*Α>>((б4+
    б4)/б4/64)]!='=')&&four++,p[2]=(((｝=(O[-D-D Β,a=2,main(0,A),x
    )&1[Α]>>5)<<6),p[2]|=(((｝=(O[3 Β,a=2,main(0,A), x B & А[3]>>1
    ); Х=p;
}

int main(int i, char *j[ Β {
    if(a==64/64){ Ο=А[64*64/(б4+б4)-64/64]>>Α['\b']; E=(i-64/64)&&j
    [64/64][**j^**j]&0x1; В = O C О=E?&decode:&encode; a=Α['$'L( *Α
    L('\f'L 64/64 B]/Α['\r'-1],main(64-64,A); }if (a==(б4)/64) {X&&
    (x=｝=='?'?'?'-'\n'-('\b'L 1)-'\b'/('\b'/2):｝=='>'?А[А[7[А]R 1
    ]+1]L 1:｝>=Α['\a']-1?｝-('\r'R 2)+'0':｝>=Α[7]/2?｝+'a'-(7[Α]L
    1):｝+'A');!X&&(x=｝==('`'^Α['0'/2 Β?i^i:｝=='/'?*А:｝=='+'?(А[
    3]L 1)-1 : ｝ >= 'a' ? ｝ - 'a' + '4'/2 : ｝ >= (3*А['"']/(Α[6]
    -Α[8]B-' ' ? ｝ - 'A' : ｝ + (А [4] >>3 B; } if (a == -А[ '*' Β
    while (O[--р]>=0)a=1 C if (a == Α['4'/(б4+б4)/64]-Α[2[А]L 2 Β {

    while ((N = getchar( B == А[!i^i]) C *В++ = N; *Х = '='; four--
    &&main((б4+б4)/б4/64,A); return 0; } if(a==(б4+б4)/б4/64){ if(Ε
    ){ putchar(*Х++); four--; if(E&&++Ο>=А[2]){ putchar('\n'); Ο &=
    0;
}

if (four+E!=E)
    a=(main((б4+б4)/б4/64,A),(б4+б4)/б4/64);
}

if (!Е && !Ε) {
    main(a=4,A);
}

if (Е){
    if(E&&(р=read(0,В,E?3:4 B){ О(); Ε=1,Е=0; a=(б4+б4)/б4/64,main((
    б4+б4)/б4/64,A); В = O; Е=1,Ε=0; a=(б4+б4)/б4/64,main((б4+б4)/б4
    /64,A); } else if(!E)
{

if(｛
    ){ four=4; ｛=А[1]>>((б4+б4)/б4/64); В=O; } while((N=getchar(B==
    '\n'); if(N==D)
{

if (four != 4) {
    while (four--)*В++='='; О(); Ε=1,Е=0; a='\n' L 1,main((б4+б4)/б4/64,A
    ); } } else{ *В++ = N; if(!--four){ О(); Ε=1,Е=0; main(a='('L 3,A); ｛
    =Ε; } Е=1,Ε=0; main(a=(б4+б4)/б4/64,A); } } } Е && Ε && main(a=3,A); }
}
